perf-tests/results_20260402_201751/go/hey_customer_summary_50k.txt

Summary:
  Total:	0.6709 secs
  Slowest:	0.0335 secs
  Fastest:	0.0001 secs
  Average:	0.0065 secs
  Requests/sec:	74524.3715
  
  Total data:	23700000 bytes
  Size/request:	474 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [9878]	|■■■■■■■■■■■■■■■■
  0.007 [24726]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [8458]	|■■■■■■■■■■■■■■
  0.013 [2840]	|■■■■■
  0.017 [1897]	|■■■
  0.020 [1232]	|■■
  0.023 [487]	|■
  0.027 [317]	|■
  0.030 [130]	|
  0.034 [34]	|


Latency distribution:
  10%% in 0.0023 secs
  25%% in 0.0039 secs
  50%% in 0.0054 secs
  75%% in 0.0076 secs
  90%% in 0.0123 secs
  95%% in 0.0162 secs
  99%% in 0.0233 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0134 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0117 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0170 secs
  resp wait:	0.0052 secs, 0.0000 secs, 0.0279 secs
  resp read:	0.0008 secs, 0.0000 secs, 0.0183 secs

Status code distribution:
  [200]	50000 responses