perf-tests/results_20260402_201751/go/hey_customers_50k.txt

Summary:
  Total:	0.6502 secs
  Slowest:	0.0379 secs
  Fastest:	0.0001 secs
  Average:	0.0063 secs
  Requests/sec:	76896.4146
  
  Total data:	7100000 bytes
  Size/request:	142 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [8654]	|■■■■■■■■■■■
  0.008 [31838]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [5367]	|■■■■■■■
  0.015 [2192]	|■■■
  0.019 [1235]	|■■
  0.023 [363]	|
  0.027 [95]	|
  0.030 [122]	|
  0.034 [60]	|
  0.038 [73]	|


Latency distribution:
  10%% in 0.0027 secs
  25%% in 0.0045 secs
  50%% in 0.0056 secs
  75%% in 0.0067 secs
  90%% in 0.0104 secs
  95%% in 0.0141 secs
  99%% in 0.0204 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0170 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0122 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0139 secs
  resp wait:	0.0054 secs, 0.0000 secs, 0.0259 secs
  resp read:	0.0006 secs, 0.0000 secs, 0.0160 secs

Status code distribution:
  [200]	50000 responses