perf-tests/results_20260402_201751/go/k6_stress_customer_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/tests/../k6_stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m20s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 010/200 VUs, 45 complete and 0 interrupted iterations
default   [   1% ] 010/200 VUs  0m01.0s/1m20.0s

running (0m02.0s), 020/200 VUs, 190 complete and 0 interrupted iterations
default   [   2% ] 020/200 VUs  0m02.0s/1m20.0s

running (0m03.0s), 030/200 VUs, 435 complete and 0 interrupted iterations
default   [   4% ] 030/200 VUs  0m03.0s/1m20.0s

running (0m04.0s), 040/200 VUs, 504 complete and 0 interrupted iterations
default   [   5% ] 040/200 VUs  0m04.0s/1m20.0s

running (0m05.0s), 050/200 VUs, 949 complete and 0 interrupted iterations
default   [   6% ] 050/200 VUs  0m05.0s/1m20.0s

running (0m06.0s), 060/200 VUs, 1494 complete and 0 interrupted iterations
default   [   7% ] 060/200 VUs  0m06.0s/1m20.0s

running (0m07.0s), 070/200 VUs, 2139 complete and 0 interrupted iterations
default   [   9% ] 070/200 VUs  0m07.0s/1m20.0s

running (0m08.0s), 080/200 VUs, 2884 complete and 0 interrupted iterations
default   [  10% ] 080/200 VUs  0m08.0s/1m20.0s

running (0m09.0s), 089/200 VUs, 3640 complete and 0 interrupted iterations
default   [  11% ] 090/200 VUs  0m09.0s/1m20.0s

running (0m10.0s), 099/200 VUs, 4261 complete and 0 interrupted iterations
default   [  12% ] 099/200 VUs  0m10.0s/1m20.0s

running (0m11.0s), 100/200 VUs, 4861 complete and 0 interrupted iterations
default   [  14% ] 100/200 VUs  0m11.0s/1m20.0s

running (0m12.0s), 100/200 VUs, 5861 complete and 0 interrupted iterations
default   [  15% ] 100/200 VUs  0m12.0s/1m20.0s

running (0m13.0s), 100/200 VUs, 6861 complete and 0 interrupted iterations
default   [  16% ] 100/200 VUs  0m13.0s/1m20.0s

running (0m14.0s), 100/200 VUs, 7861 complete and 0 interrupted iterations
default   [  17% ] 100/200 VUs  0m14.0s/1m20.0s

running (0m15.0s), 100/200 VUs, 8861 complete and 0 interrupted iterations
default   [  19% ] 100/200 VUs  0m15.0s/1m20.0s

running (0m16.0s), 100/200 VUs, 9761 complete and 0 interrupted iterations
default   [  20% ] 100/200 VUs  0m16.0s/1m20.0s

running (0m17.0s), 100/200 VUs, 10061 complete and 0 interrupted iterations
default   [  21% ] 100/200 VUs  0m17.0s/1m20.0s

running (0m18.0s), 100/200 VUs, 11061 complete and 0 interrupted iterations
default   [  22% ] 100/200 VUs  0m18.0s/1m20.0s

running (0m19.0s), 100/200 VUs, 12061 complete and 0 interrupted iterations
default   [  24% ] 100/200 VUs  0m19.0s/1m20.0s

running (0m20.0s), 100/200 VUs, 12961 complete and 0 interrupted iterations
default   [  25% ] 100/200 VUs  0m20.0s/1m20.0s

running (0m21.0s), 100/200 VUs, 13961 complete and 0 interrupted iterations
default   [  26% ] 100/200 VUs  0m21.0s/1m20.0s

running (0m22.0s), 100/200 VUs, 14961 complete and 0 interrupted iterations
default   [  27% ] 100/200 VUs  0m22.0s/1m20.0s

running (0m23.0s), 100/200 VUs, 15561 complete and 0 interrupted iterations
default   [  29% ] 100/200 VUs  0m23.0s/1m20.0s

running (0m24.0s), 100/200 VUs, 16161 complete and 0 interrupted iterations
default   [  30% ] 100/200 VUs  0m24.0s/1m20.0s

running (0m25.0s), 100/200 VUs, 17161 complete and 0 interrupted iterations
default   [  31% ] 100/200 VUs  0m25.0s/1m20.0s

running (0m26.0s), 100/200 VUs, 18161 complete and 0 interrupted iterations
default   [  32% ] 100/200 VUs  0m26.0s/1m20.0s

running (0m27.0s), 100/200 VUs, 19061 complete and 0 interrupted iterations
default   [  34% ] 100/200 VUs  0m27.0s/1m20.0s

running (0m28.0s), 100/200 VUs, 20061 complete and 0 interrupted iterations
default   [  35% ] 100/200 VUs  0m28.0s/1m20.0s

running (0m29.0s), 100/200 VUs, 21061 complete and 0 interrupted iterations
default   [  36% ] 100/200 VUs  0m29.0s/1m20.0s

running (0m30.0s), 100/200 VUs, 21324 complete and 0 interrupted iterations
default   [  37% ] 100/200 VUs  0m30.0s/1m20.0s

running (0m31.0s), 100/200 VUs, 22324 complete and 0 interrupted iterations
default   [  39% ] 100/200 VUs  0m31.0s/1m20.0s

running (0m32.0s), 100/200 VUs, 23324 complete and 0 interrupted iterations
default   [  40% ] 100/200 VUs  0m32.0s/1m20.0s

running (0m33.0s), 100/200 VUs, 24234 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  0m33.0s/1m20.0s

running (0m34.0s), 100/200 VUs, 25224 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  0m34.0s/1m20.0s

running (0m35.0s), 100/200 VUs, 26224 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  0m35.0s/1m20.0s

running (0m36.0s), 100/200 VUs, 26824 complete and 0 interrupted iterations
default   [  45% ] 100/200 VUs  0m36.0s/1m20.0s

running (0m37.0s), 100/200 VUs, 27424 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  0m37.0s/1m20.0s

running (0m38.0s), 100/200 VUs, 28424 complete and 0 interrupted iterations
default   [  48% ] 100/200 VUs  0m38.0s/1m20.0s

running (0m39.0s), 100/200 VUs, 29424 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  0m39.0s/1m20.0s

running (0m40.0s), 100/200 VUs, 30324 complete and 0 interrupted iterations
default   [  50% ] 100/200 VUs  0m40.0s/1m20.0s

running (0m41.0s), 109/200 VUs, 31360 complete and 0 interrupted iterations
default   [  51% ] 109/200 VUs  0m41.0s/1m20.0s

running (0m42.0s), 119/200 VUs, 32495 complete and 0 interrupted iterations
default   [  52% ] 119/200 VUs  0m42.0s/1m20.0s

running (0m43.0s), 129/200 VUs, 32748 complete and 0 interrupted iterations
default   [  54% ] 129/200 VUs  0m43.0s/1m20.0s

running (0m44.0s), 139/200 VUs, 34083 complete and 0 interrupted iterations
default   [  55% ] 139/200 VUs  0m44.0s/1m20.0s

running (0m45.0s), 149/200 VUs, 35518 complete and 0 interrupted iterations
default   [  56% ] 149/200 VUs  0m45.0s/1m20.0s

running (0m46.0s), 159/200 VUs, 37053 complete and 0 interrupted iterations
default   [  57% ] 159/200 VUs  0m46.0s/1m20.0s

running (0m47.0s), 169/200 VUs, 38688 complete and 0 interrupted iterations
default   [  59% ] 169/200 VUs  0m47.0s/1m20.0s

running (0m48.0s), 179/200 VUs, 40423 complete and 0 interrupted iterations
default   [  60% ] 179/200 VUs  0m48.0s/1m20.0s

running (0m49.0s), 189/200 VUs, 41538 complete and 0 interrupted iterations
default   [  61% ] 189/200 VUs  0m49.0s/1m20.0s

running (0m50.0s), 199/200 VUs, 42711 complete and 0 interrupted iterations
default   [  62% ] 199/200 VUs  0m50.0s/1m20.0s

running (0m51.0s), 200/200 VUs, 44710 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  0m51.0s/1m20.0s

running (0m52.0s), 200/200 VUs, 46710 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  0m52.0s/1m20.0s

running (0m53.0s), 200/200 VUs, 48517 complete and 0 interrupted iterations
default   [  66% ] 200/200 VUs  0m53.0s/1m20.0s

running (0m54.0s), 200/200 VUs, 50517 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  0m54.0s/1m20.0s

running (0m55.0s), 200/200 VUs, 52517 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  0m55.0s/1m20.0s

running (0m56.0s), 200/200 VUs, 52976 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  0m56.0s/1m20.0s

running (0m57.0s), 200/200 VUs, 54976 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  0m57.0s/1m20.0s

running (0m58.0s), 200/200 VUs, 56976 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  0m58.0s/1m20.0s

running (0m59.0s), 200/200 VUs, 58976 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  0m59.0s/1m20.0s

running (1m00.0s), 200/200 VUs, 60776 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  1m00.0s/1m20.0s

running (1m01.0s), 200/200 VUs, 62776 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  1m01.0s/1m20.0s

running (1m02.0s), 200/200 VUs, 64176 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  1m02.0s/1m20.0s

running (1m03.0s), 200/200 VUs, 65376 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  1m03.0s/1m20.0s

running (1m04.0s), 200/200 VUs, 67334 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  1m04.0s/1m20.0s

running (1m05.0s), 200/200 VUs, 69176 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  1m05.0s/1m20.0s

running (1m06.0s), 200/200 VUs, 71176 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  1m06.0s/1m20.0s

running (1m07.0s), 200/200 VUs, 73176 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  1m07.0s/1m20.0s

running (1m08.0s), 200/200 VUs, 75176 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  1m08.0s/1m20.0s

running (1m09.0s), 200/200 VUs, 75576 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  1m09.0s/1m20.0s

running (1m10.0s), 200/200 VUs, 77576 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  1m10.0s/1m20.0s

running (1m11.0s), 182/200 VUs, 79504 complete and 0 interrupted iterations
default   [  89% ] 182/200 VUs  1m11.0s/1m20.0s

running (1m12.0s), 161/200 VUs, 81225 complete and 0 interrupted iterations
default   [  90% ] 161/200 VUs  1m12.0s/1m20.0s

running (1m13.0s), 143/200 VUs, 82670 complete and 0 interrupted iterations
default   [  91% ] 143/200 VUs  1m13.0s/1m20.0s

running (1m14.0s), 122/200 VUs, 83938 complete and 0 interrupted iterations
default   [  92% ] 122/200 VUs  1m14.0s/1m20.0s

running (1m15.0s), 108/200 VUs, 84750 complete and 0 interrupted iterations
default   [  94% ] 108/200 VUs  1m15.0s/1m20.0s

running (1m16.0s), 083/200 VUs, 85210 complete and 0 interrupted iterations
default   [  95% ] 083/200 VUs  1m16.0s/1m20.0s

running (1m17.0s), 062/200 VUs, 85947 complete and 0 interrupted iterations
default   [  96% ] 062/200 VUs  1m17.0s/1m20.0s

running (1m18.0s), 042/200 VUs, 86477 complete and 0 interrupted iterations
default   [  97% ] 042/200 VUs  1m18.0s/1m20.0s

running (1m19.0s), 022/200 VUs, 86807 complete and 0 interrupted iterations
default   [  99% ] 022/200 VUs  1m19.0s/1m20.0s

running (1m20.0s), 001/200 VUs, 86930 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  1m20.0s/1m20.0s

     ✓ status 200

     checks.........................: 100.00% 86931 out of 86931
     data_received..................: 51 MB   633 kB/s
     data_sent......................: 8.9 MB  111 kB/s
     http_req_blocked...............: avg=5.11µs   min=0s       med=3µs      max=4.84ms   p(90)=5µs      p(95)=7µs     
     http_req_connecting............: avg=953ns    min=0s       med=0s       max=1.2ms    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=14.41ms  min=45µs     med=731µs    max=796.14ms p(90)=3ms      p(95)=4.48ms  
       { expected_response:true }...: avg=14.41ms  min=45µs     med=731µs    max=796.14ms p(90)=3ms      p(95)=4.48ms  
     http_req_failed................: 0.00%   0 out of 86931
     http_req_receiving.............: avg=40.9µs   min=3µs      med=14µs     max=9.22ms   p(90)=52µs     p(95)=119µs   
     http_req_sending...............: avg=58.26µs  min=1µs      med=7µs      max=8.49ms   p(90)=102µs    p(95)=276µs   
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=14.31ms  min=38µs     med=655µs    max=796.12ms p(90)=2.79ms   p(95)=4.1ms   
     http_reqs......................: 86931   1085.802491/s
     iteration_duration.............: avg=115.19ms min=100.08ms med=101.54ms max=898.96ms p(90)=104.52ms p(95)=106.26ms
     iterations.....................: 86931   1085.802491/s
     vus............................: 1       min=1              max=200
     vus_max........................: 200     min=200            max=200


running (1m20.1s), 000/200 VUs, 86931 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m20s